{
    "Yang Chen": {
        "id": "yang-chen",
        "year": "2026",
        "tags": [
            "Artist/Creative", "Music/Audio"
        ],
            "description": [
                "This is a portfolio website for Yang Chen, a percussionist and composer. The site features a bold brutalist design and showcases Yang's work and experience in the music industry. It was designed and developed between September 2025 and January 2026."
            ],
        "image": "./assets/projects/yang-chen.png",
        "site": "https://yangchen.ca"
    },
    "I.D. Guide": {
        "id": "idguide",
        "year": "2025",
        "tags": [
            "Non-profit",
            "Advocacy"
        ],
            "description": [
                "This is the latest version of my free community-driven resource to help Canadians navigate legal name, gender marker, and I.D. changes.",
                "The site offers step-by-step guides, official forms, and region-specific information, with a focus on supporting trans, non-binary, Two-Spirit, and gender non-conforming communities. It is a fast, accessible, modern web app written in TypeScript, independently researched and designed for ease of use, and was launched in December 2025."
            ],
        "image": "./assets/projects/idguide.png",
        "site": "https://idguide.ca"
    },
    "True History Brewing": {
        "id": "true-history-brewing",
        "year": "2025",
        "tags": [
            "Business/Storefront"
        ],
        "description": [
            "This is a website for True History Brewing, a brewery and taproom located in Toronto. The project included custom designs and animations to reflect the brand's identity, and integrates with their other online platforms. It was originally launched in March 2024, with a full redesign completed in October 2025."
        ],
        "image": "./assets/projects/truehistory.png",
        "site": "https://truehistorybeer.com"
    },
    "Therapy with Andrea": {
        "id": "andrea-lynn-ferguson",
        "year": "2025",
        "tags": [
            "Professional"
        ],
        "description": [
            "This is a portfolio website for Andrea Lynn Ferguson, registered psychotherapist (qualifying). It was completed between May and June 2025."
        ],
        "image": "./assets/projects/andrea-lynn-ferguson.png",
        "site": "https://andrealynnferguson.com/"
    },
    "Tony Matthews": {
        "id": "tony-matthews",
        "year": "2025",
        "tags": [
            "Artist/Creative",
            "Professional"
        ],
        "description": [
            "This is a portfolio website for Tony Matthews, laying out his experience in digital media production, animated features, VFX, studio operations, engineering, consulting, speaking engagements, and leadership. It was designed and developed from March to June 2025."
        ],
        "image": "./assets/projects/tony-matthews.jpg",
        "site": "https://www.tony-matthews.com/"
    },
    "Ryan Perks": {
        "id": "ryan-perks",
        "year": "2025",
        "tags": [
            "Freelancer",
            "Writing/Editing"
        ],
        "description": [
            "This is a portfolio website for Ryan Perks, a professional book editor. It was completed between December 2024 and February 2025."
        ],
        "image": "./assets/projects/ryanperks.png",
        "site": "https://ryanperks.com"
    },
    "Hazel Henry Audio": {
        "id": "hazel-henry-audio",
        "year": "2025",
        "tags": [
            "Freelancer",
            "Music/Audio"
        ],
        "description": [
            "This is a portfolio website for Hazel Henry, a rock music producer based in Portland, Oregon. The site provides information about Hazel's work, portfolio, and services. It was designed and built between January and April 2025."
        ],
        "image": "./assets/projects/hazel-henry-audio.png",
        "site": "https://hazelhenryaudio.com/"
    },
    "Poe M. Allphin": {
        "id": "poe-m-allphin",
        "year": "2025",
        "tags": [
            "Academic",
            "Music/Audio"
        ],
        "description": [
            "This is a portfolio website for Poe M. Allphin, a PhD student in musicology and adjunct lecturer at CUNY. The site provides information about Poe's academic work, teaching, and research. It was completed between February and April 2025."
        ],
        "image": "./assets/projects/poe-m-allphin.png",
        "site": "https://poemallphin.com"
    },
    "Point Pelee Planner": {
        "id": "point-pelee-planner",
        "year": "2025",
        "tags": [
            "Advocacy",
            "Open-source"
        ],
        "description": [
            "This is a web application designed to help visitors plan their trips to Point Pelee National Park. Built using the open-source Pytheas framework, the app provides interactive maps, curated site information, and custom itinerary features to enhance the park experience.",
            "I led development on the project in summer 2025, with funding and support from Parallel 42 Systems and Windsor Hackforge."
        ],
        "image": "./assets/projects/point-pelee-planner.png",
        "site": "https://pointpeleeplanner.com/"
    },
    "Connect Fund": {
        "id": "connect-fund",
        "year": "2024",
        "tags": [
            "Non-profit",
            "Advocacy"
        ],
        "description": [
            "This is a website for Connect Fund, a non-profit organization supporting healthcare for 2SLGBTQ+ communities in Canada. The site enables online donations and facilitates information sharing with donors and clients. It was launched in summer 2024, with ongoing updates and design support."
        ],
        "image": "./assets/projects/connectfund.png",
        "site": "https://www.connectfund.org/"
    },
    "Michael Cloud Duguay": {
        "id": "michael-cloud-duguay",
        "year": "2024",
        "tags": [
            "Artist/Creative",
            "Music/Audio"
        ],
        "description": [
            "This is a portfolio website for Michael Cloud Duguay, a composer, producer, and accordionist. The site features a fully custom design and highlights his many creative projects. It was designed and developed in 2024."
        ],
        "image": "./assets/projects/michaelcduguay.png",
        "site": "https://www.michaelcduguay.com/"
    },
    "Nina Milanovski": {
        "id": "nina-milanovski",
        "year": "2024",
        "tags": [
            "Artist/Creative"
        ],
        "description": [
            "This is a portfolio website for Nina Milanovski, a dance artist and producer. The site features a lively, visually expressive design inspired by her practice. The project was completed between February and March 2024."
        ],
        "image": "./assets/projects/ninamilanovski.jpg",
        "site": "https://ninamilanovski.com"
    },
    "Sydney Gautreau": {
        "id": "sydney-gautreau",
        "year": "2024",
        "tags": [
            "Freelancer",
            "Writing/Editing"
        ],
        "description": [
            "This is a website for Sydney Gautreau's editing and writing coaching business. It features a professional, custom design and highlights Sydney's services and experience. The original site was completed in 2022, with upgrades in 2023 and 2024."
        ],
        "image": "./assets/projects/sydneygautreau.png",
        "site": "https://sydneygautreau.com"
    },
    "Queer Walk": {
        "id": "queer-walk",
        "year": "2023",
        "tags": [
            "Advocacy",
            "Open-source"
        ],
        "description": [
            "This is a guided walking tour app for the 2SLGBTQAI+ community in Windsor-Essex, Ontario, built with React and the open-source Pytheas framework. The project included significant upgrades to the framework's functionality.",
            "I led development on the project in summer 2023, with funding and support from Parallel 42 Systems, Windsor Hackforge, and Walter Cassidy of the Windsor-Essex Rainbow Alliance."
        ],
        "image": "./assets/projects/queer-walk.png",
        "site": "https://queerwalk.ca"
    }
}