{
    "Queer Walk / Pytheas": {
        "year": "2023",
        "stack": [
            "React",
            "TypeScript",
            "Emotion",
            "Jotai"
        ],
        "description": [
            "This application is a guided walking tour of historic locations for the 2SLGBTQAI+ community in Windsor-Essex, Ontario, built between May and August 2023 as an implementation of the open-source Pytheas codebase.",
            "I was the lead developer on this project, working alongside Haley Tibbitts, and our project manager, Zhenia Tomé, with funding and support from Parallel 42 Systems and Windsor Hackforge. The research and organizing for this tour was provided by Walter Cassidy of the Windsor-Essex Rainbow Alliance.",
            "The Pytheas application itself is based on work originally developed for the McDougall Corridor tour application, built in partnership with the Essex County Black Historical Research Society, the Windsor Law Centre for Cities, the School of Creative Arts (SOCA), and Leddy Library, with funding provided by Canada's federal government through the Canadian Urban Institute. The development of this implementation resulted in several significant functional upgrades to the Pytheas project."
        ],
        "site": "https://queerwalk.ca",
        "repo": "https://github.com/p42systems/pytheas-WindsorLGBTQ"
    },
    "Pigeon Pad": {
        "year": "2023",
        "stack": [
            "Angular",
            "TypeScript",
            "SASS"
        ],
        "description": [
            "This is a notes application written in Typescript using the Angular framework that I originally built in February 2023.",
            "The site allows the user to save up to 12 notes between 1-85 characters in length, each in the colour of their choice (pink, purple, green, or yellow). It uses the Angular local storage API to save the data client-side so the notes are persistent until the user's browser cache is cleared."
        ],
        "site": "https://pigeon-pad.netlify.app/",
        "repo": "https://github.com/torontopubliclibra/pigeon-pad"
    },
    "Superhero Showdown": {
        "year": "2022",
        "stack": [
            "React",
            "JavaScript",
            "CSS",
            "Firebase"
        ],
        "description": [
            "This is a statistics-based card game that I originally built in October and November 2022 during my time at Juno College. The site was built as a single-page application using the React library, using data pulled from the Marvel Database Wiki and stored in a database on Firebase.",
            "On game start, 20 superhero character objects with various statistics are pulled from the database, shuffled, and dealt into 2 decks of 10 cards each—one for the player and one for the computer. Each round, the player chooses the stat from their card that they think is larger than the computer's and the winner of the challenge gets both cards. Gameplay continues until one deck is out of cards."
        ],
        "site": "/superhero",
        "repo": "https://github.com/torontopubliclibra/dana-teagle-project-three"
    },
    "The Pigeon Hole": {
        "year": "2022",
        "stack": [
            "HTML",
            "jQuery",
            "CSS"
        ],
        "description": [
            "This is an API project that I originally built with HTML and jQuery in July 2022 during my time at Juno College. The app displays photos of pigeons in different cities, retrieved from the Flickr API, based on the user's selection or by random."
        ],
        "site": "/pigeon",
        "repo": "https://github.com/torontopubliclibra/the-pigeon-hole"
    },
    "Sydney Gautreau": {
        "year": "2022",
        "stack": [
            "HTML",
            "JavaScript",
            "SASS"
        ],
        "description": [
            "This is a website I originally built in November 2022, for Sydney's editing and writing coaching business. The features of the site include a Javascript hamburger menu and a contact form."
        ],
        "site": "https://sydneygautreau.com",
        "repo": "https://github.com/torontopubliclibra/sydney-gautreau"
    }
}