{
    "True History Brewing": {
        "year": "2023",
        "tags": [
            "JavaScript",
            "React",
            "Shopify",
            "Remix",
            "Hydrogen/Oxygen",
            "Strapi",
            "SCSS"
        ],
        "description": [
            "This is a website and online storefront for True History (a brewery and taproom in Toronto, Ontario), currently being developed as a React Remix site with a headless Shopify storefront, and launching in early 2024. Please check back soon."
        ],
        "code": "/thb/repo"
    },
    "Note Taken": {
        "year": "2023",
        "tags": [
            "Angular",
            "TypeScript",
            "Filesaver.js",
            "SCSS"
        ],
        "description": [
            "This is a local storage notes app built with Angular. Users can save up to 50 text notes of 140 characters each in various colours. All inputted data is stored client-side and remains in the browser until the next time the cache is cleared. Notes can be sorted, filtered, searched, edited, and deleted, as well as exported to a .txt file for archiving (using Filesaver.js)."
        ],
        "site": "/notes",
        "code": "/notes/repo"
    },
    "Queer Walk": {
        "year": "2023",
        "tags": [
            "React",
            "TypeScript",
            "Jotai",
            "Emotion",
            "GeoJSON"
        ],
        "description": [
            "This is a guided walking tour app for the 2SLGBTQAI+ community in Windsor-Essex, Ontario, built with React and using the open-source Pytheas framework.",
            "The application guides users through a selected tour length, and displays text and photos for each historic location. I was the lead developer on the application, working from May to Aug 2023 alongside Haley Tibbitts and our project manager Zhenia Tomé, with funding and support from Parallel 42 Systems and Windsor Hackforge. The research and organizing for the tour was provided by Walter Cassidy of the Windsor-Essex Rainbow Alliance."
        ],
        "site": "https://queerwalk.ca",
        "code": "https://github.com/p42systems/pytheas-WindsorLGBTQ"
    },
    "Superhero Showdown": {
        "year": "2022",
        "tags": [
            "React",
            "JavaScript",
            "Firebase",
            "CSS"
        ],
        "description": [
            "This is an online stats-based card game built with React, using characters from Marvel Comics.",
            "When the game starts, a set of data objects (each representing a character) are retrieved, shuffled, and divided into 2 decks of 10 cards each. Every round, you choose the statistic from your card that you believe to be larger than the other deck's, and the winner of the challenge gets both cards. The game continues until one of the players runs out of cards.",
            "I originally built Superhero Showdown in 2022 during my time at Juno College."
        ],
        "site": "/superhero",
        "code": "/superhero/repo"
    },
    "The Pigeon Hole": {
        "year": "2022",
        "tags": [
            "HTML",
            "Jquery",
            "CSS"
        ],
        "description": [
            "This is an app for viewing photos of pigeons in different cities around the world built with jQuery and the Flickr API.",
            "The site retrieves data objects representing photos of pigeons, either in the user's selected city or in a randomized city, and then it randomly selects one of the images and displays it on the page. I originally developed The Pigeon Hole in July 2022 during my time at Juno College, before later updating it in 2023."
        ],
        "site": "/pigeon",
        "code": "/pigeon/repo"
    },
    "Sydney Gautreau": {
        "year": "2022",
        "tags": [
            "HTML",
            "JavaScript",
            "SCSS"
        ],
        "description": [
            "This is a website for Sydney Gautreau's editing & writing coaching business, originally built in 2022."
        ],
        "site": "https://sydneygautreau.com",
        "code": "https://github.com/torontopubliclibra/sydney-gautreau"
    },
    "Body Stories Dance": {
        "year": "2022",
        "tags": [
            "Squarespace",
            "JavaScript"
        ],
        "description": [
            "This is a website for Body Stories Dance Education & Performance, a dance studio in Manitoulin, Ontario. I designed their logo, marketing materials, and website in 2021 and 2022."
        ],
        "site": "https://www.bodystoriesdance.com/"
    }
}