{
    "Trans I.D.": {
        "year": "2024",
        "tags": [
            "Figma",
            "Affinity-designer",
            "TypeScript",
            "Vue.js"
        ],
        "description": [
            "Trans I.D. will be an online hub serving transgender, Two-Spirit, non-binary, or otherwise gender non-conforming individuals living in Ontario. It will provide resources on all the steps required in changing one's name and/or legal gender marker with government services and various other organizations.",
            "I've led workshops on name and gender marker changes for 2SLGBTQI+ folks in Ontario since 2021. I'm currently working to acquire funding for this application, and hoping to hire a small development team later with a projected launch of 2025 or 2026.",
            "You can find documents, resources, and presentation materials I've collected for Ontario Trans I.D. at <a href='https://danateagle.com/trans-id' target='_blank'>this link</a>."
        ]
    },
    "Michael Cloud Duguay": {
        "year": "2024",
        "tags": [
            "Webflow",
            "Figma",
            "HTML",
            "CSS"
        ],
        "description": [
            "This is a website for Michael Cloud Duguay—a composer, producer, improviser, and accordionist from Peterborough, Ontario—that I designed and built in summer 2024."
        ],
        "site": "https://www.michaelcduguay.com/"
    },
    "Connect Fund": {
        "year": "2024",
        "tags": [
            "Webflow",
            "Figma",
            "HTML",
            "CSS"
        ],
        "description": [
            "Connect Fund is a not-for-profit organization aiming to provide comprehensive and widespread funding to 2SLGBTQ+ communities in Ontario to access the healthcare they need, led by Dr. Kate Greenaway, and based in Toronto, Ontario.",
            "In summer 2024, I worked with the Connect Fund team to launch a web platform for receiving charitable donations and supporting clients."
        ],
        "site": "https://www.connectfund.org/"
    },
    "WEST83 Consulting": {
        "year": "2024",
        "tags": [
            "Affinity-designer",
            "Google-sites"
        ],
        "description": [
            "WEST83 is a business consulting and strategic planning firm led by Dr. Jessica Sartori and based in Windsor, Ontario. In summer 2024, I designed branding for the firm and helped them launch a basic website."
        ],
        "site": "https://www.west83.com/"
    },
    "True History Brewing": {
        "year": "2024",
        "tags": [
            "JavaScript",
            "Figma",
            "React.js",
            "Remix",
            "Shopify",
            "CSS",
            "SCSS",
            "Strapi"
        ],
        "description": [
            "This is a website and online shop for True History Brewing, a brewery and taproom in Toronto, Ontario, Canada. The site was initially launched in March 2024, and will be updated in the near future with full storefront functionality.",
            "The project is built with React Remix, and uses Hydrogen as a headless Shopify storefront for online orders, and Strapi as a headless CMS for non-storefront related variable data (hours, events, menus, etc.). The site's custom design was wireframed using Figma, and styled with SCSS."
        ],
        "site": "https://truehistorybeer.com"
    },
    "Nina Milanovski": {
        "year": "2024",
        "tags": [
            "Jquery",
            "HTML",
            "CSS",
            "SCSS"
        ],
        "description": [
            "This is a portfolio website for Nina Milanovski, dance artist and producer, built with jQuery, HTML, and SCSS. I designed and created the site in February and March 2024. It is fully responsive and includes a JavaScript media carousel for portfolio projects, as well as a contact form."
        ],
        "site": "https://ninamilanovski.com"
    },
    "Sydney Gautreau": {
        "year": "2024",
        "tags": [
            "Jquery",
            "HTML",
            "CSS",
            "SCSS"
        ],
        "description": [
            "This is a website for Sydney Gautreau's editing & writing coaching business, built with jQuery, HTML, and SCSS. It was originally designed and created in 2022, and received style and functionality upgrades in 2023 and 2024. The site is fully responsive and includes a contact form."
        ],
        "site": "https://sydneygautreau.com"
    },
    "Queer Walk": {
        "year": "2023",
        "tags": [
            "TypeScript",
            "React.js",
            "Leaflet",
            "GeoJSON",
            "Jotai",
            "CSS"
        ],
        "description": [
            "This is a guided walking tour app for the 2SLGBTQAI+ community in Windsor-Essex, Ontario, built with React and using the open-source Pytheas framework. The application guides users through a selected tour length, and displays text and photos for each historic location.",
            "I was the lead developer on the application, working from May to Aug 2023 alongside <a href='https://haleytibbitts.com/' target='_blank'>Haley Tibbitts</a> and our project manager Zhenia Tomé, with funding and support from <a href='https://www.p42systems.com/' target='_blank'>Parallel 42 Systems</a> and <a href='https://www.hackf.org/' target='_blank'>Windsor Hackforge</a>. The research and organizing for the tour was provided by Walter Cassidy of the Windsor-Essex Rainbow Alliance."
        ],
        "site": "https://queerwalk.ca",
        "code": "https://github.com/p42systems/pytheas-WindsorLGBTQ"
    },
    "Note Taken": {
        "year": "2023",
        "tags": [
            "TypeScript",
            "Angular",
            "CSS",
            "SCSS"
        ],
        "description": [
            "This is a notes app built with Angular, Typescript, and SCSS, that stores all inputted data locally without sending anything to a database. Unless deleted, your notes remain secure in the browser on your device until you clear the cache. You can save up to 50 text notes of 140 characters each in various colours. They can be sorted, filtered, searched, edited, and deleted, as well as exported to a .txt file. I originally developed the site in Feb 2023 as Pigeon Pad, and then relaunched it as Note Taken in Sept 2023 with improved functionality and an updated design."
        ],
        "site": "/notes",
        "code": "/notes/repo"
    },
    "Superhero Showdown": {
        "year": "2022",
        "tags": [
            "JavaScript",
            "React.js",
            "CSS"
        ],
        "description": [
            "This is a statistics-based card game written in JavaScript and CSS using the React library.",
            "The site uses a data set of superhero character objects stored in Firebase, each with statistics pulled from the Marvel Database Wiki. On game start, the character objects are retrieved, shuffled, and dealt into 2 decks of 10 cards each—one for you (the player) and one for your opponent (the computer). Each round, you choose the statistic from your card that you believe to be larger than your opponent's, and the winner of the challenge gets both cards. Game play continues until one of the decks is empty.",
            "I designed and developed Superhero Showdown in 2022 and have since updated the styling."
        ],
        "site": "/superhero",
        "code": "/superhero/repo"
    },
    "The Pigeon Hole": {
        "year": "2022",
        "tags": [
            "Jquery",
            "HTML",
            "CSS",
            "SCSS"
        ],
        "description": [
            "This is an application for viewing images of pigeons in different cities around the world, written in HTML, jQuery, and SCSS, and using the Flickr API. The site retrieves JSON data representing photos of pigeons, either in the user's selected city or in a random city, it shuffles through those image objects, and then it displays one of the photos on the page.",
            "I originally built the Pigeon Hole in July 2022 during my time at Juno College, relaunched it with improved scripts and updated styles in Sept 2023, and I continue to update and improve it periodically."
        ],
        "site": "/pigeon",
        "code": "/pigeon/repo"
    },
    "Body Stories Dance": {
        "year": "2021",
        "tags": [
            "Squarespace",
            "JavaScript"
        ],
        "description": [
            "This is a website for Body Stories Dance Education & Performance, a dance business based in Manitoulin, Ontario. The site was originally built with Squarespace and JavaScript in 2021."
        ],
        "site": "https://www.bodystoriesdance.com/"
    },
    "The Crevice": {
        "year": "2021",
        "tags": [
            "Squarespace",
            "JavaScript"
        ],
        "description": [
            "This is a website for 'The Crevice', a live-streamed sitcom play performed at the Bus Stop Theatre in Halifax, Nova Scotia. The site was originally built with Squarespace and JavaScript in 2021."
        ],
        "site": "https://thecrevice.ca/"
    }
}