{
    "Trans I.D.": {
        "year": "2024",
        "tags": [
            "TypeScript",
            "Vue.js"
        ],
        "description": [
            "Trans I.D. will be an online hub providing resources for trans, non-binary, Two-Spirit, or otherwise gender non-conforming individuals living in Canada on how to change their name and/or legal gender marker with governments and services in Canada.",
            "This web app has been in various stages of development since 2022, and I am currently working to acquire funding, either through grants or charitable donations. I'm hoping to hire a small development team at that point, and aim for a projected launch in late 2024 or early 2025."
        ]
    },
    "True History Brewing": {
        "year": "2024",
        "tags": [
            "JavaScript",
            "React.js",
            "Remix",
            "Hydrogen",
            "Shopify",
            "GraphQL",
            "SASS",
            "Strapi"
        ],
        "description": [
            "This is a website and online shop for True History Brewing, a brewery and taproom in Toronto, Ontario, Canada. It will be launching in late January 2024.",
            "The site is built with React and Remix, and uses Hydrogen as a headless Shopify storefront for online orders, with Strapi as a headless CMS for non-storefront related variable data (hours, events, menus, etc)."
        ],
        "code": "/thb/repo"
    },
    "Sydney Gautreau, Editor & Writing Coach": {
        "year": "2024",
        "tags": [
            "Jquery",
            "HTML",
            "SASS"
        ],
        "description": [
            "This is a website for Sydney Gautreau's editing & writing coaching business, built with jQuery, HTML, and SCSS. It was originally designed and created in 2022, and received style and functionality upgrades in 2023 and 2024."
        ],
        "site": "https://sydneygautreau.com",
        "code": "https://github.com/torontopubliclibra/sydney-gautreau"
    },
    "Queer Walk": {
        "year": "2023",
        "tags": [
            "TypeScript",
            "React.js",
            "Vite",
            "Jotai",
            "Emotion",
            "CSS"
        ],
        "description": [
            "This is a guided walking tour app for the 2SLGBTQAI+ community in Windsor-Essex, Ontario, built with React.js and using the open-source Pytheas framework.",
            "The application guides users through a selected tour length, and displays text and photos for each historic location. I was the lead developer on the application, working from May to Aug 2023 alongside Haley Tibbitts and our project manager Zhenia Tomé, with funding and support from Parallel 42 Systems and Windsor Hackforge. The research and organizing for the tour was provided by Walter Cassidy of the Windsor-Essex Rainbow Alliance."
        ],
        "site": "https://queerwalk.ca",
        "code": "https://github.com/p42systems/pytheas-WindsorLGBTQ"
    },
    "Note Taken": {
        "year": "2023",
        "tags": [
            "TypeScript",
            "Angular",
            "SASS"
        ],
        "description": [
            "This is a local storage notes app built with Angular. Users can save up to 50 text notes of 140 characters each in various colours. All inputted data is stored client-side and remains in the browser until the next time the cache is cleared. Notes can be sorted, filtered, searched, edited, and deleted, as well as exported to a .txt file for archiving (using Filesaver.js).",
            "I originally developed the site throughout 2023."
        ],
        "site": "/notes",
        "code": "/notes/repo"
    },
    "Superhero Showdown": {
        "year": "2022",
        "tags": [
            "JavaScript",
            "React.js",
            "CSS"
        ],
        "description": [
            "This is an online stats-based card game built with React.js, using characters from Marvel Comics.",
            "When the game starts, a set of data objects (each representing a character) are retrieved, shuffled, and divided into 2 decks of 10 cards each. Every round, you choose the statistic from your card that you believe to be larger than the other deck's, and the winner of the challenge gets both cards. The game continues until one of the players runs out of cards.",
            "I originally built Superhero Showdown in 2022 during my time at Juno College."
        ],
        "site": "/superhero",
        "code": "/superhero/repo"
    },
    "The Pigeon Hole": {
        "year": "2022",
        "tags": [
            "Jquery",
            "HTML",
            "CSS"
        ],
        "description": [
            "This is an app for viewing photos of pigeons in different cities around the world built with jQuery and the Flickr API.",
            "The site retrieves data objects representing photos of pigeons, either in the user's selected city or in a randomized city, and then it randomly selects one of the images and displays it on the page. I originally developed The Pigeon Hole in July 2022 during my time at Juno College, before later updating it in 2023."
        ],
        "site": "/pigeon",
        "code": "/pigeon/repo"
    }
}