{
    "THB": {
        "cite": "— Matthew Tompkins | Owner & Founder, True History Brewing",
        "quote": "“I consider myself a pretty articulate person but when it comes to communicating our vision for <a href='https://truehistorybeer.com' target='_blank' title='True History Brewing website'>TrueHistoryBeer.com</a>, we spent years lost in the wilderness. Like many other business owners I'm not very literate about the language of websites and how I want something to look and feel. Dana's superpower is her ability to translate ideas; to hear what I'm saying and tell me what I mean. That seems simple but it unlocked all of our potential and a process that used to give me anxiety suddenly became fun. I've worked with many people and few have made me feel as at ease and confident as Dana.”"
    },
    "Queer Walk": {
        "cite": "— Lauren Hedges | Managing Director, Windsor Hackforge",
        "quote": "“Hackforge engaged Dana to lead the development team implementing <a href='https://queerwalk.ca' target='_blank' title='Queer Walk website'>QueerWalk.ca</a> in spring/summer 2023 and she was an absolute pleasure to work with. In addition to quickly grasping the goals of the project, Dana anticipated obstacles and offered creative solutions to them. She always delivered on-time and to spec, and adapted to changing requirements. When communicating with management, teammates, and the client, Dana was clear and professional and she was able to work through any difficult situations that arose.”"
    },
    "MCD": {
        "cite": "— Michael Cloud Duguay | Musician, composer, and producer",
        "quote": "“Working with Dana on developing <a href='https://www.michaelcduguay.com/' target='_blank' title='Michael Cloud Duguay website'>my website</a> was a notably positive experience. Her aesthetic vision is distinct and focused and she guided me through the technical aspects with transparency and in a collaborative spirit that I really appreciated. Her communication was punctual and respectful and we met all deadlines on time. I will continue to work with Dana for all of my web design needs, and recommend her to any of my peers needing this sort of work. I love the website that she designed for me.”"
    }
}